tap "buo/cask-upgrade"
tap "craciuncezar/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# tap "jesseduffield/lazygit"

brew "automake"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "gcc"
brew "gcc@11"
brew "gnu-sed"
brew "gnupg"
brew "llvm"
brew "ninja"
brew "pkg-config"
brew "ruby"
brew "shared-mime-info"
brew "terminal-notifier"

brew "bat"
brew "btop"
brew "ccls"
brew "craciuncezar/tap/git-smart-checkout"
brew "eza"
brew "fd"
brew "fnm"
brew "fontforge"
brew "fortune"
brew "fzf"
brew "gettext"
brew "gh"
brew "git-delta"
brew "go"
brew "harfbuzz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "librsync"
brew "libtool"
brew "libyaml"
brew "little-cms2"
brew "lnav"
brew "lua@5.1"
brew "luajit"
brew "luarocks"
brew "n"
brew "neovim", args: ["HEAD"]
brew "neovim-remote"
brew "nginx"
brew "openssl@3"
# brew "pandoc"
brew "pgcli"
brew "pgformatter"
brew "pinentry-mac"
brew "postgresql@14"
brew "python@3.9"
brew "python@3.10"
brew "ripgrep"
brew "rustup"
brew "silicon"
brew "sqlcmd"
brew "sqlparse"
brew "sqlite-utils"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "virtualenv"
brew "vivid"
brew "wget"
brew "xz"
brew "zk", args: ["HEAD"]
brew "zlib"
brew "zoxide"
brew "zsh-completions"

cask "alt-tab"
cask "dash"
# cask "docker"
cask "hammerspoon"
cask "hiddenbar"
# cask "karabiner-elements"
cask "kitty"
cask "maccy"
# cask "postman"
cask "shottr"
cask "stats"
cask "the-unarchiver"
# cask "vlc"
cask "wkhtmltopdf"
